; domain
(define (domain NUT-ASSEMBLY)
  (:requirements :strips :typing)

  ;; Types
  (:types nut peg robot)

  ;; Predicates
  (:predicates
    (free ?p - peg)
    (handempty ?r - robot)
    (grasped ?r - robot ?n - nut)
    (on_peg ?n - nut ?p - peg)
    (assembled ?n - nut)

    ;; Type predicates
    (is_hex ?n - nut)
    (is_square ?n - nut)
    (is_circular ?p - peg)
    (is_square_peg ?p - peg)

    ;; Compatibility
    (compatible ?n - nut ?p - peg)
  )

  ;; Pick action
  (:action pick
    :parameters (?r - robot ?n - nut)
    :precondition (handempty ?r)
    :effect (and 
      (grasped ?r ?n)
      (not (handempty ?r))
    )
  )

  ;; Generic Place action using compatibility
  (:action place
    :parameters (?r - robot ?n - nut ?p - peg)
    :precondition (and 
        (grasped ?r ?n)
        (free ?p)
        (compatible ?n ?p)
    )
    :effect (and
        (on_peg ?n ?p)
        (assembled ?n)
        (not (grasped ?r ?n))
        (handempty ?r)
        (not (free ?p))
    )
  )
)

; problem
(define (problem nut-assembly)
  (:domain NUT-ASSEMBLY)

  (:objects
    robot1 - robot
    hexnut squarenut - nut
    square round - peg
  )

  (:init

    ;; Pegs are free
    (free square)
    (free round)

    ;; Robot is not holding anything
    (handempty robot1)

    ;; Nut types
    (is_hex hexnut)
    (is_square squarenut)

    ;; Peg types
    (is_square_peg square)
    (is_circular round)

    ;;compatibility
    (compatible hexnut round)
    (compatible squarenut square)
  )

  (:goal
    (and
      (assembled hexnut)
      (assembled squarenut)
    )
  )
)

; plan
1. (pick robot1 squarenut)
   deleted: (handempty robot1)
   added: (grasped robot1 squarenut)
   goals met: 0 of 2
2. (place robot1 squarenut square)
   deleted: (grasped robot1 squarenut) (free square)
   added: (on_peg squarenut square) (assembled squarenut) (handempty robot1)
   goals met: 1 of 2
3. (pick robot1 hexnut)
   deleted: (handempty robot1)
   added: (grasped robot1 hexnut)
   goals met: 1 of 2
4. (place robot1 hexnut round)
   deleted: (grasped robot1 hexnut) (free round)
   added: (on_peg hexnut round) (assembled hexnut) (handempty robot1)
   goals met: 2 of 2
